In [14]:
# 결측치 (Missing Data)
# CSV 파일 읽어오기

import pandas as pd

path = "data.csv"

dt = pd.read_csv(path, encoding='cp949')

In [7]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   class   219 non-null    object
 1   cty     226 non-null    float64
 2   hwy     229 non-null    float64
dtypes: float64(2), object(1)
memory usage: 5.6+ KB

In [9]:
dt

       class    cty   hwy
0    compact   18.0  29.0
1    compact   21.0  29.0
2    compact    NaN  31.0
3    compact   21.0  30.0
4    compact   16.0  26.0
..       ...    ...   ...
229  midsize   19.0  28.0
230  midsize  999.0  29.0
231  midsize   16.0  26.0
232  midsize   18.0  26.0
233      NaN   17.0  26.0

[234 rows x 3 columns]

In [13]:
dt.isnull().sum()

class    15
cty       8
hwy       5
dtype: int64

In [15]:
# 결측치 제거

# df.dropna(axis-0)  :  행 결측치 제거
# df.driobna(axis-1)  :  열 결측치 제거
# df.dropna()

In [22]:
type(dt)

pandas.core.frame.DataFrame

In [23]:
dt.drop(dt.index[233])

       class    cty   hwy
0    compact   18.0  29.0
1    compact   21.0  29.0
2    compact    NaN  31.0
3    compact   21.0  30.0
4    compact   16.0  26.0
..       ...    ...   ...
228  midsize   18.0  29.0
229  midsize   19.0  28.0
230  midsize  999.0  29.0
231  midsize   16.0  26.0
232  midsize   18.0  26.0

[233 rows x 3 columns]

In [24]:
dt

       class    cty   hwy
0    compact   18.0  29.0
1    compact   21.0  29.0
2    compact    NaN  31.0
3    compact   21.0  30.0
4    compact   16.0  26.0
..       ...    ...   ...
229  midsize   19.0  28.0
230  midsize  999.0  29.0
231  midsize   16.0  26.0
232  midsize   18.0  26.0
233      NaN   17.0  26.0

[234 rows x 3 columns]

In [25]:
dt.notnull().sum(1)

0      3
1      3
2      2
3      3
4      3
      ..
229    3
230    3
231    3
232    3
233    2
Length: 234, dtype: int64

In [38]:
series_notnull = dt.notnull().sum(1)
print(type(series_notnull))

<class 'pandas.core.series.Series'>

In [40]:
dt.isnull().sum()

class    15
cty       8
hwy       5
dtype: int64

In [54]:
dt['class'].dropna(axis=0)

0      compact
1      compact
3      compact
4      compact
5      compact
        ...
228    midsize
229    midsize
230    midsize
231    midsize
232    midsize
Name: class, Length: 206, dtype: object

In [56]:
dt

       class    cty   hwy
0    compact   18.0  29.0
1    compact   21.0  29.0
3    compact   21.0  30.0
4    compact   16.0  26.0
5    compact   18.0  26.0
..       ...    ...   ...
228  midsize   18.0  29.0
229  midsize   19.0  28.0
230  midsize  999.0  29.0
231  midsize   16.0  26.0
232  midsize   18.0  26.0

[206 rows x 3 columns]

In [61]:
dt[['class','cty','hwy']]

       class    cty   hwy
0    compact   18.0  29.0
1    compact   21.0  29.0
2    compact    NaN  31.0
3    compact   21.0  30.0
4    compact   16.0  26.0
..       ...    ...   ...
229  midsize   19.0  28.0
230  midsize  999.0  29.0
231  midsize   16.0  26.0
232  midsize   18.0  26.0
233      NaN   17.0  26.0

[234 rows x 3 columns]

In [70]:
dt = pd.read_csv(path, encoding='cp949')

In [71]:
dt

       class    cty   hwy
0    compact   18.0  29.0
1    compact   21.0  29.0
2    compact    NaN  31.0
3    compact   21.0  30.0
4    compact   16.0  26.0
..       ...    ...   ...
229  midsize   19.0  28.0
230  midsize  999.0  29.0
231  midsize   16.0  26.0
232  midsize   18.0  26.0
233      NaN   17.0  26.0

[234 rows x 3 columns]

In [72]:
dt.isnull().sum()

class    15
cty       8
hwy       5
dtype: int64

In [76]:
dt_backup = dt
dt_backup.mean()

cty     29.588496
hwy    115.135371
dtype: float64

In [77]:
dt_backup.mean()['cty']

29.588495575221238

In [79]:
dt_backup = dt_backup['cty'].fillna(dt_backup.mean()['cty'])

In [80]:
dt_backup.isnull().sum()

0

In [81]:
dt['hwy'] = dt['hwy'].fillna(dt['hwy'].mean())

In [82]:
dt.isnull().sum()

class    15
cty       8
hwy       0
dtype: int64